{
  "_name_or_path": "nvidia/mit-b0",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "shirt, blouse",
    "1": "top, t-shirt, sweatshirt",
    "2": "sweater",
    "3": "cardigan",
    "4": "jacket",
    "5": "vest",
    "6": "pants",
    "7": "shorts",
    "8": "skirt",
    "9": "coat",
    "10": "dress",
    "11": "jumpsuit",
    "12": "cape",
    "13": "glasses",
    "14": "hat",
    "15": "headband, head covering, hair accessory",
    "16": "tie",
    "17": "glove",
    "18": "watch",
    "19": "belt",
    "20": "leg warmer",
    "21": "tights, stockings",
    "22": "sock",
    "23": "shoe",
    "24": "bag, wallet",
    "25": "scarf",
    "26": "umbrella",
    "27": "hood",
    "28": "collar",
    "29": "lapel",
    "30": "epaulette",
    "31": "sleeve",
    "32": "pocket",
    "33": "neckline",
    "34": "buckle",
    "35": "zipper",
    "36": "applique",
    "37": "bead",
    "38": "bow",
    "39": "flower",
    "40": "fringe",
    "41": "ribbon",
    "42": "rivet",
    "43": "ruffle",
    "44": "sequin",
    "45": "tassel"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "applique": 36,
    "bag, wallet": 24,
    "bead": 37,
    "belt": 19,
    "bow": 38,
    "buckle": 34,
    "cape": 12,
    "cardigan": 3,
    "coat": 9,
    "collar": 28,
    "dress": 10,
    "epaulette": 30,
    "flower": 39,
    "fringe": 40,
    "glasses": 13,
    "glove": 17,
    "hat": 14,
    "headband, head covering, hair accessory": 15,
    "hood": 27,
    "jacket": 4,
    "jumpsuit": 11,
    "lapel": 29,
    "leg warmer": 20,
    "neckline": 33,
    "pants": 6,
    "pocket": 32,
    "ribbon": 41,
    "rivet": 42,
    "ruffle": 43,
    "scarf": 25,
    "sequin": 44,
    "shirt, blouse": 0,
    "shoe": 23,
    "shorts": 7,
    "skirt": 8,
    "sleeve": 31,
    "sock": 22,
    "sweater": 2,
    "tassel": 45,
    "tie": 16,
    "tights, stockings": 21,
    "top, t-shirt, sweatshirt": 1,
    "umbrella": 26,
    "vest": 5,
    "watch": 18,
    "zipper": 35
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.49.0"
}
